{
  "auth": {
    "login": "تسجيل دخول",
    "phone_no": "رقم الجوال",
    "phone_no_hint": "أدخل رقم الجوال",
    "password": "كلمة المرور",
    "forgot_pass": "هل نسيت كلمة المرور؟",
    "as_guest": "الدخول كزائر",
    "no_account": "لا يوجد لديك حساب ؟",
    "create_account": " قم بإنشاء حساب",
    "name": "الإسم",
    "name_hint": "أدخل الإسم",
    "email": "البريد الإلكتروني",
    "email_hint": "أدخل البريد الإلكتروني",
    "school_degree": "المرحلة الدراسية",
    "school_degree_hint": "أدخل المرحلة الدراسية",
    "password_conf": "تأكيد كلمة المرور",
    "account_creation": "إنشاء حساب",
    "signup": "تسجيل جديد",
    "dummy_text": "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد هذا النص هو مثال لنص يمكن أن",
    "no_code": "لم تستلم الكود؟",
    "resend": "أعد الارسال",
    "remaining_time": "الوقت المتبقى",
    "enter": "الدخول",
    "password_reset": "إستعادة كلمة المرور",
    "send": "إرسال",
    "code": "الكود",
    "code_hint": "الرجاء ادخال الكود المرسل اليك",
    "new_password": "كلمة المرور الجديدة",
    "new_pass_conf": "تأكيد كلمة المرور الجديدة",
    "account_activation": "تفعيل الحساب",
    "edit_profile": "تعديل الحساب",
    "change_pass": "تغيير كلمة المرور",
    "save": "حفظ"
  },
  "layout": {
    "more": "المزيد",
    "cart": "السلة",
    "purchases": "المشتريات",
    "my_purchases": "مشترياتي",
    "home": "الرئيسية"
  },
  "more": {
    "my_account": "حسابي",
    "wallet": "المحفظة",
    "invoices": "الفواتير",
    "pay_cards": "بطاقات الدفع",
    "service_provider": "مقدمي الخدمة المتابعيين",
    "be_provider": "كن مقدم خدمة",
    "favorite": "المفضلة",
    "rate_us": "قيمنا",
    "contact_us": "تواصل معنا",
    "complain": "الشكاوي والمقترحات",
    "share_app": "مشاركة المنصة",
    "settings": "الإعدادات"
  }
}